Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectSelector Methods
The AnalysisObjectSelector type exposes the following members.
Methods
Name | Description
GetAllObjects
 Returns an enumerator of all the model objects in the current model. NOT YET IMPLEMENTED.
GetAllObjectsWithType
 Returns an enumerator of all the model objects in the current model with the given type.
GetAnalysisModels
 Returns an enumerator of all the analysis model objects.
GetSelectedObjects
 Returns an enumerator of all the selected model objects in the current model. NOT YET IMPLEMENTED.
Top
See Also
Reference
AnalysisObjectSelector Class
Tekla.Structures.Analysis Namespace